In [34]:
# Python SQL toolkit and Object Relational Mapper
import sqlalchemy
from sqlalchemy.ext.automap import automap_base
from sqlalchemy.orm import Session
from sqlalchemy import create_engine
import pandas as pd

In [35]:
# Create engine using the `demographics.sqlite` database file
engine = create_engine("sqlite:///../Resources/demographics.sqlite")

In [36]:
# Declare a Base using `automap_base()`
# YOUR CODE HERE
Base= automap_base()

In [37]:
# Use the Base class to reflect the database tables
# YOUR CODE HERE
Base.prepare(engine, reflect=True)

In [38]:
# Print all of the classes mapped to the Base
# YOUR CODE HERE
Base.classes.keys()

['demographics']

In [39]:
# Assign the demographics class to a variable called `Demographics`
# YOUR CODE HERE
demo = Base.classes.demographics

In [40]:
# Create a session
# YOUR CODE HERE
session = Session(engine)

In [62]:
# Use the session to query Demographics table and display the first 5 locations
# YOUR CODE HERE
first_row = session.query(demo).first()
all = session.query(demo)
print(all)

SELECT demographics.id AS demographics_id, demographics.age AS demographics_age, demographics.height_meter AS demographics_height_meter, demographics.weight_kg AS demographics_weight_kg, demographics.children AS demographics_children, demographics.occupation AS demographics_occupation, demographics.academic_degree AS demographics_academic_degree, demographics.salary AS demographics_salary, demographics.location AS demographics_location
FROM demographics

In [59]:
str(session.query(demo.location).statement)

'SELECT demographics.location \nFROM demographics'

In [42]:
for row in session.query(demo.location).limit(5).all():
    print(row)

('South Dakota',)
('Delaware',)
('South Dakota',)
('Louisiana',)
('West Virginia',)

In [43]:
# BONUS: Query and print the number of unique Locations
# Hints: Look into counting and grouping operations in SQLAlchemy
# YOUR CODE HERE
locations = session.query(demo).group_by(demo.location).count()
print(locations)

5

In [67]:
str(all.statement)

'SELECT demographics.id, demographics.age, demographics.height_meter, demographics.weight_kg, demographics.children, demographics.occupation, demographics.academic_degree, demographics.salary, demographics.location \nFROM demographics'

In [66]:
alldf=pd.read_sql(all.statement, session.bind)
alldf.head()

,id,age,height_meter,weight_kg,children,occupation,academic_degree,salary,location
0,0,58,1.87,53.0,1,Choreographer,PhD,68,South Dakota
1,1,65,1.80,40.0,0,Cellarman,Bachelor,73,Delaware
2,2,32,1.80,73.0,1,Veterinary Surgeon,Master,69,South Dakota
3,3,61,1.79,89.0,0,Hawker,PhD,88,Louisiana
4,4,23,1.64,51.0,2,Choreographer,Bachelor,83,West Virginia

In [68]:
### SHOWING STRING
alldf=pd.read_sql('SELECT demographics.id, demographics.age, demographics.height_meter, demographics.weight_kg, demographics.children, demographics.occupation, demographics.academic_degree, demographics.salary, demographics.location \nFROM demographics', session.bind)
alldf.head()

,id,age,height_meter,weight_kg,children,occupation,academic_degree,salary,location
0,0,58,1.87,53.0,1,Choreographer,PhD,68,South Dakota
1,1,65,1.80,40.0,0,Cellarman,Bachelor,73,Delaware
2,2,32,1.80,73.0,1,Veterinary Surgeon,Master,69,South Dakota
3,3,61,1.79,89.0,0,Hawker,PhD,88,Louisiana
4,4,23,1.64,51.0,2,Choreographer,Bachelor,83,West Virginia